[
  {
    "entry_id": "e_001",
    "date": "2025-10-01",
    "text": "Feeling overwhelmed at work. Deadlines piling up. Hard to stay motivated."
  },
  {
    "entry_id": "e_002",
    "date": "2025-10-02",
    "text": "Another late night. Tired and worried about the project review tomorrow."
  },
  {
    "entry_id": "e_003",
    "date": "2025-10-04",
    "text": "Back-to-back meetings and constant pressure. Feeling anxious and unfocused."
  },
  {
    "entry_id": "e_004",
    "date": "2025-10-05",
    "text": "Skipped lunch again. Still behind schedule, but trying to push through."
  },
  {
    "entry_id": "e_005",
    "date": "2025-10-07",
    "text": "Stopped to reflect why I’m doing this job. Thinking about long-term direction and meaning."
  },
  {
    "entry_id": "e_006",
    "date": "2025-10-08",
    "text": "Journaled about my core values—kindness, curiosity, growth. Wondering if my current path fits them."
  },
  {
    "entry_id": "e_007",
    "date": "2025-10-09",
    "text": "Talked with a mentor about feeling stuck. Encouraged to align work with my values."
  },
  {
    "entry_id": "e_008",
    "date": "2025-10-11",
    "text": "Went for a long walk today. Breathing deeply helped me calm down. Grateful for some quiet time."
  },
  {
    "entry_id": "e_009",
    "date": "2025-10-12",
    "text": "Tried a small experiment at work that felt more aligned with my values. Felt proud of taking initiative."
  },
  {
    "entry_id": "e_010",
    "date": "2025-10-13",
    "text": "Cooked dinner with a close friend. Laughed and felt more connected. Less tension today."
  },
  {
    "entry_id": "e_011",
    "date": "2025-10-15",
    "text": "Started focusing on what I can control. Acceptance helps me stay calmer through challenges."
  },
  {
    "entry_id": "e_012",
    "date": "2025-10-16",
    "text": "Woke up early and stretched for ten minutes. Feeling balanced and more focused."
  },
  {
    "entry_id": "e_013",
    "date": "2025-10-18",
    "text": "Had a brief worry about next week, but used deep breathing to ground myself."
  },
  {
    "entry_id": "e_014",
    "date": "2025-10-19",
    "text": "Feeling steady and productive. Making progress on key tasks without overthinking."
  },
  {
    "entry_id": "e_015",
    "date": "2025-10-21",
    "text": "Grateful for small wins and support from colleagues. Feeling calm and re-energized."
  }
]
